Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionTextAttributes Constructor
 Creates a new dimension text attributes instance. By default the default font is used, no frame is drawn and the value text is above the dimension line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionTextAttributes()
Public Sub New
See Also
Reference
DimensionSetBaseAttributes.DimensionTextAttributes Class
DimensionSetBaseAttributes.DimensionTextAttributes Overload
Tekla.Structures.Drawing Namespace